<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Finds latest OneNote installer, downloads the pkg.
</string>
    <key>Identifier</key>
    <string>com.github.arubdesu.munki.MSOneNote2016</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOneNote2016</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>installs</key>
            <array>
                <dict>
                    <key>CFBundleIdentifier</key>
                    <string>com.microsoft.onenote.mac</string>
                    <key>CFBundleName</key>
                    <string>OneNote</string>
                    <key>path</key>
                    <string>/Applications/Microsoft OneNote.app</string>
                </dict>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>blocking_applications</key>
            <array>
              <string>Microsoft OneNote</string>
              <string>Microsoft Error Reporting</string>
              <string>Microsoft Auto Update</string>
            </array>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.arubdesu.pkg.MSOneNote2016</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSOffice2016URLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>